microsoft-integration/WSEClient_Net2.0/MerchantAPI/obj/Debug/Earthport.MerchantAPI.ServiceMetadata.wsdl.MerchantAPI.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
    Document: MerchantAPI.wsdl
    Earthport Merchant API Web service definition version 1
    Copyright 2008 Eathport Plc. All rights reserved.
-->
<wsdl:definitions xmlns:impl="http://customer.endpoint.earthport.com/api/merchant/v1" xmlns:intf="http://customer.endpoint.earthport.com/api/merchant/v1" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsi="http://ws-i.org/profiles/basic/1.1/xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://customer.endpoint.earthport.com/api/merchant/v1">

    <wsdl:types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://customer.endpoint.earthport.com/api/merchant/v1">
            <simpleType name="AckType">
                <restriction base="string">
                    <enumeration value="success"/>
                    <enumeration value="failure"/>
                </restriction>
            </simpleType>
            <complexType name="Request">
                <sequence>
                    <any/>
                </sequence>
            </complexType>
            <complexType name="Response">
                <sequence>
                    <element name="ack" type="impl:AckType"/>
                    <any/>
                </sequence>
            </complexType>
            <element name="submitDocument">
                <complexType>
                    <sequence>
                        <element name="parameters" nillable="true" type="impl:Request"/>
                    </sequence>
                </complexType>
            </element>
            <element name="submitDocumentResponse">
                <complexType>
                    <sequence>
                        <element name="submitDocumentReturn" nillable="true" type="impl:Response"/>
                    </sequence>
                </complexType>
            </element>
        </schema>
    </wsdl:types>

    <wsdl:message name="submitDocumentRequest">
        <wsdl:part element="impl:submitDocument" name="parameters"/>
    </wsdl:message>

    <wsdl:message name="submitDocumentResponse">
        <wsdl:part element="impl:submitDocumentResponse" name="parameters"/>
    </wsdl:message>

    <wsdl:portType name="MerchantAPI">
        <wsdl:operation name="submitDocument">
            <wsdl:input message="impl:submitDocumentRequest" name="submitDocumentRequest"/>
            <wsdl:output message="impl:submitDocumentResponse" name="submitDocumentResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="MerchantAPISoapBinding" type="impl:MerchantAPI">

        <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

        <wsdl:operation name="submitDocument">

            <wsdlsoap:operation soapAction=""/>

            <wsdl:input name="submitDocumentRequest">

                <wsdlsoap:body use="literal"/>

            </wsdl:input>

            <wsdl:output name="submitDocumentResponse">

                <wsdlsoap:body use="literal"/>

            </wsdl:output>

        </wsdl:operation>

    </wsdl:binding>

    <wsdl:service name="MerchantAPIService">

        <wsdl:port binding="impl:MerchantAPISoapBinding" name="MerchantAPI">

            <wsdlsoap:address location="https://sandbox.earthport.com/MerchantAPI"/>

        </wsdl:port>

    </wsdl:service>

</wsdl:definitions>
